WelcomeText = \
"""\
سلام %(first_name)s، یک فایل برای من ارسال کن تا بلافاصله لینک‌های دانلود آن تولید شود.

دستورات:
/privacy - مشاهده سیاست حفظ حریم خصوصی ربات.
/log - دریافت فایل لاگ ربات. (فقط مالک)
/help - نمایش این پیام.
"""

PrivacyText = \
"""
سیاست حفظ حریم خصوصی

1. ذخیره‌سازی داده: فایل‌هایی که ارسال می‌کنید به‌طور امن در کانال خصوصی تلگرام ربات ذخیره می‌شوند.

2. لینک‌های دانلود: لینک‌ها شامل یک کد مخفی هستند تا از دسترسی غیرمجاز جلوگیری شود.

3. کنترل کاربر: شما می‌توانید در هر زمانی با استفاده از دکمه "لغو" لینک‌ها را غیرفعال کنید.

4. نظارت: مالک ربات می‌تواند در صورت لزوم فایل‌های شما را مشاهده و حذف کند.

5. برای ارتباط با پشتیبانی به @alpha365R پیام دهید

6. نگهداری: فایل‌ها تا زمانی که لینک آن‌ها لغو نشود، ذخیره خواهند شد.

با استفاده از این ربات، شما با این سیاست موافقت می‌کنید.
"""

FileLinksText = \
"""
لینک دانلود:
%(dl_link)s
"""

MediaLinksText = \
"""
لینک دانلود:
%(dl_link)s
لینک پخش آنلاین:
%(stream_link)s
"""

InvalidQueryText = \
"""
داده‌های درخواست ناسازگار هستند.
"""

MessageNotExist = \
"""
فایل حذف شده یا وجود ندارد.
"""

LinkRevokedText = \
"""
لینک لغو شده است. ممکن است اعمال تغییرات کمی زمان ببرد.
"""

InvalidPayloadText = \
"""
مقدار دریافتی نامعتبر است.
"""

UserNotInAllowedList = \
"""
شما اجازه استفاده از این ربات را ندارید.
"""
